{"modelTopology": {"model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "name": "conv2d", "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "strides": [1, 1], "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "name": "conv2d_1", "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "strides": [1, 1], "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "name": "conv2d_2", "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "strides": [1, 1], "dtype": "float32"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten", "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "dense", "bias_constraint": null, "trainable": true, "units": 64, "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "softmax", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "dense_1", "bias_constraint": null, "trainable": true, "units": 10, "dtype": "float32"}}], "name": "sequential"}}, "keras_version": "2.1.6-tf", "backend": "tensorflow", "training_config": {"weighted_metrics": null, "loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "sample_weight_mode": null, "optimizer_config": {"class_name": "RMSprop", "config": {"decay": 0.0, "epsilon": 1e-07, "lr": 0.0010000000474974513, "rho": 0.8999999761581421}}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [3, 3, 1, 32], "name": "conv2d/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d/bias", "dtype": "float32"}, {"shape": [3, 3, 32, 64], "name": "conv2d_1/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_1/bias", "dtype": "float32"}, {"shape": [3, 3, 64, 64], "name": "conv2d_2/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_2/bias", "dtype": "float32"}, {"shape": [576, 64], "name": "dense/kernel", "dtype": "float32"}, {"shape": [64], "name": "dense/bias", "dtype": "float32"}, {"shape": [64, 10], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [10], "name": "dense_1/bias", "dtype": "float32"}]}]}