{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"config": {"output_layers": [["conv2d_26", 0, 0]], "name": "model", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 90], "name": "input_1", "sparse": false}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 3200, "trainable": true, "name": "dense_5", "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_5", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"dtype": "float32", "target_shape": [4, 4, 200], "trainable": false, "name": "reshape_2"}, "class_name": "Reshape", "name": "reshape_2", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"config": {"dtype": "float32", "size": [2, 2], "trainable": false, "name": "up_sampling2d_8", "data_format": "channels_last"}, "class_name": "UpSampling2D", "name": "up_sampling2d_8", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"config": {"dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "activation": "relu", "strides": [1, 1], "name": "conv2d_22", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "filters": 150, "use_bias": true, "kernel_constraint": null, "padding": "same"}, "class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]]}, {"config": {"dtype": "float32", "size": [2, 2], "trainable": false, "name": "up_sampling2d_9", "data_format": "channels_last"}, "class_name": "UpSampling2D", "name": "up_sampling2d_9", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"config": {"dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "activation": "relu", "strides": [1, 1], "name": "conv2d_23", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "filters": 80, "use_bias": true, "kernel_constraint": null, "padding": "same"}, "class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["up_sampling2d_9", 0, 0, {}]]]}, {"config": {"dtype": "float32", "size": [2, 2], "trainable": false, "name": "up_sampling2d_10", "data_format": "channels_last"}, "class_name": "UpSampling2D", "name": "up_sampling2d_10", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"config": {"dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "activation": "relu", "strides": [1, 1], "name": "conv2d_24", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "filters": 40, "use_bias": true, "kernel_constraint": null, "padding": "same"}, "class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["up_sampling2d_10", 0, 0, {}]]]}, {"config": {"dtype": "float32", "size": [2, 2], "trainable": false, "name": "up_sampling2d_11", "data_format": "channels_last"}, "class_name": "UpSampling2D", "name": "up_sampling2d_11", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"config": {"dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "activation": "relu", "strides": [1, 1], "name": "conv2d_25", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "filters": 15, "use_bias": true, "kernel_constraint": null, "padding": "same"}, "class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["up_sampling2d_11", 0, 0, {}]]]}, {"config": {"dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "activation": "sigmoid", "strides": [1, 1], "name": "conv2d_26", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "filters": 3, "use_bias": true, "kernel_constraint": null, "padding": "same"}, "class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}, "training_config": {"loss": "binary_crossentropy", "metrics": [], "weighted_metrics": null, "loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"config": {"epsilon": 1e-07, "lr": 0.009999999776482582, "decay": 0.0}, "class_name": "Adagrad"}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv2d_22/kernel", "shape": [3, 3, 200, 150], "dtype": "float32"}, {"name": "conv2d_22/bias", "shape": [150], "dtype": "float32"}, {"name": "conv2d_23/kernel", "shape": [3, 3, 150, 80], "dtype": "float32"}, {"name": "conv2d_23/bias", "shape": [80], "dtype": "float32"}, {"name": "conv2d_24/kernel", "shape": [3, 3, 80, 40], "dtype": "float32"}, {"name": "conv2d_24/bias", "shape": [40], "dtype": "float32"}, {"name": "conv2d_25/kernel", "shape": [3, 3, 40, 15], "dtype": "float32"}, {"name": "conv2d_25/bias", "shape": [15], "dtype": "float32"}, {"name": "conv2d_26/kernel", "shape": [3, 3, 15, 3], "dtype": "float32"}, {"name": "conv2d_26/bias", "shape": [3], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [90, 3200], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [3200], "dtype": "float32"}]}]}