{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"config": {"input_layers": [["input_14", 0, 0]], "name": "model_10", "output_layers": [["conv2d_26", 0, 0]], "layers": [{"name": "input_14", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 200], "name": "input_14"}}, {"name": "dense_5", "inbound_nodes": [[["input_14", 0, 0, {}]]], "class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "name": "dense_5", "bias_constraint": null, "units": 3200, "bias_regularizer": null, "use_bias": true, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}}, {"name": "reshape_2", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_2", "dtype": "float32", "target_shape": [4, 4, 200], "trainable": false}}, {"name": "up_sampling2d_8", "inbound_nodes": [[["reshape_2", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_8", "dtype": "float32", "data_format": "channels_last", "size": [2, 2], "trainable": false}}, {"name": "conv2d_22", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": false, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "filters": 150, "name": "conv2d_22", "bias_constraint": null, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"name": "up_sampling2d_9", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_9", "dtype": "float32", "data_format": "channels_last", "size": [2, 2], "trainable": false}}, {"name": "conv2d_23", "inbound_nodes": [[["up_sampling2d_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": false, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "filters": 80, "name": "conv2d_23", "bias_constraint": null, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"name": "up_sampling2d_10", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_10", "dtype": "float32", "data_format": "channels_last", "size": [2, 2], "trainable": false}}, {"name": "conv2d_24", "inbound_nodes": [[["up_sampling2d_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": false, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "filters": 40, "name": "conv2d_24", "bias_constraint": null, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"name": "up_sampling2d_11", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_11", "dtype": "float32", "data_format": "channels_last", "size": [2, 2], "trainable": false}}, {"name": "conv2d_25", "inbound_nodes": [[["up_sampling2d_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": false, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "filters": 15, "name": "conv2d_25", "bias_constraint": null, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}, {"name": "conv2d_26", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": false, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "filters": 3, "name": "conv2d_26", "bias_constraint": null, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "activation": "sigmoid", "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}}]}, "class_name": "Model"}, "training_config": {"loss": "binary_crossentropy", "optimizer_config": {"config": {"lr": 0.009999999776482582, "epsilon": 1e-07, "decay": 0.0}, "class_name": "Adagrad"}, "loss_weights": null, "sample_weight_mode": null, "metrics": [], "weighted_metrics": null}}, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"name": "conv2d_22/kernel", "shape": [3, 3, 200, 150], "dtype": "float32"}, {"name": "conv2d_22/bias", "shape": [150], "dtype": "float32"}, {"name": "conv2d_23/kernel", "shape": [3, 3, 150, 80], "dtype": "float32"}, {"name": "conv2d_23/bias", "shape": [80], "dtype": "float32"}, {"name": "conv2d_24/kernel", "shape": [3, 3, 80, 40], "dtype": "float32"}, {"name": "conv2d_24/bias", "shape": [40], "dtype": "float32"}, {"name": "conv2d_25/kernel", "shape": [3, 3, 40, 15], "dtype": "float32"}, {"name": "conv2d_25/bias", "shape": [15], "dtype": "float32"}, {"name": "conv2d_26/kernel", "shape": [3, 3, 15, 3], "dtype": "float32"}, {"name": "conv2d_26/bias", "shape": [3], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [200, 3200], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [3200], "dtype": "float32"}]}]}